In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
s1=pd.Series([4,8,15,16,23,42])
s1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

In [10]:
l1=[1,2,3,4,5,6,7,8,9,10]

In [11]:
s1=pd.Series(l1)
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
#Q3. Create a Pandas DataFrame that contains the following data:

In [14]:
d1={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df=pd.DataFrame(d1)

In [15]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [17]:
'''DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). It is similar to a spreadsheet or SQL table, where data can be stored in rows and columns.

On the other hand, a pandas Series is a one-dimensional labeled array capable of holding any data type. It is similar to a column in a DataFrame or a single column in an Excel spreadsheet.'''

'DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). It is similar to a spreadsheet or SQL table, where data can be stored in rows and columns.\n\nOn the other hand, a pandas Series is a one-dimensional labeled array capable of holding any data type. It is similar to a column in a DataFrame or a single column in an Excel spreadsheet.'

In [18]:
#example of dataframe
d1={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df=pd.DataFrame(d1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [19]:
#example of series
s1=pd.Series([4,8,15,16,23,42])
s1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [20]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?

In [21]:
#head() and tail()

In [23]:
df.head(1)  # Display the first 1 row

    Name  Age  Gender
0  Alice   25  Female

In [24]:
df.tail(1)  # Display the last 1 rows

     Name  Age  Gender
2  Claire   27  Female

In [25]:
#info()

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [28]:
#shape
df.shape

(3, 3)

In [29]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [30]:
'''Series: A pandas Series is mutable.
DataFrame: A pandas DataFrame is mutable.
Panel: Panels have been deprecated, and multi-dimensional data is typically handled using DataFrames.'''

'Series: A pandas Series is mutable.\nDataFrame: A pandas DataFrame is mutable.\nPanel: Panels have been deprecated, and multi-dimensional data is typically handled using DataFrames.'

In [31]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [32]:
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 22])
scores = pd.Series([90, 85, 88])

data = {'Name': names, 'Age': ages, 'Score': scores}
df = pd.DataFrame(data)


print(df)

      Name  Age  Score
0    Alice   25     90
1      Bob   30     85
2  Charlie   22     88